use.org
#+TITLE: Using the Feff testing framework
#+AUTHOR: Bruce Ravel
#+DATE: {{{time(%Y-%m-%d)}}}
#+SETUPFILE: theme-readtheorg-local.setup


* Prerequisites

You *must* have these tools on your computer, properly built, installed,
and functioning:

1. [[https://github.com/xraypy/xraylarch][Larch]]
2. [[https://github.com/xraypy/feff85exafs][feff85exafs]]

The following python modules are used (=sudo pip install <module>=):

1. [[https://github.com/defunkt/pystache][pystache]]
2. [[https://pypi.python.org/pypi/tabulate][tabulate]]


* Curated set of standard data

1. Copper
2. NiO
3. FeS2
4. UO2
5. BaZrO3
6. Uranyl ion in solution
7. bromoadamantane

Each of these folders has much of the same stuff as the data-bearing
tests for [[https://github.com/xraypy/feff85exafs][feff85exafs]], including a mustache template for =feff.inp=, a
json file controlling how the template is filled in, χ(k) data, a
python script defining a fitting model using Larch, and a Feff6 input
file.

Future materials:

-  methyltin, multiple data set, simple molecule
-  ???

* Established tests

** SCF

This is a test that runs any of the curated standards against a sequence
of different Feff models related to probing the effect of
self-consistency. Feff will be run in each of the following ways:

1. Feff6
2. Feff8 without self-consistency
3. Feff8 with one or more radii for the self-consistency computation

The point of this test is to evaluate the effect of the Feff model on
EXAFS fitting. This tests Feff6 against Feff8 and self-consistency
against the absence of self-consistency.

As discussed elsewhere, self-consistency provides scant impact on the
quality of the EXAFS analysis or on the measured results.

** iorder

In the paper that introduced Feff6 ([[http://dx.doi.org/10.1103/PhysRevB.52.2995][DOI: 10.1103/PhysRevB.52.2995]]),
the authors discuss an approximation made in the computation of the
Rehr-Albers separable propagators. The scaling of the spherical harmonic
scattering factors used to compute the photoelectron free propagator is
such that the corresponding matrix can be limited in dimension to 6x6.
There is some discussion about the accuracy of this approximation at
high energy, but the authors assert the numerical accuracy of this
approximation is within 1% of the full calculation at photoelectron
wavenumbers below 20.

The size of this matrix is controlled in the Feff input file by the
IORDER keyword. The default value of 2 corresponds to the 6x6 matrix.
The assertion that the 6x6 matrix is adequate is easily tested using
this testing framework.

The iorder test runs Feff8 with a short self-consistency radius and with
a range of iorder values, including 1, 2, 3, 4, and 10 (10 being
something the source code refers to as the "cute" algorithm).

Limiting the iorder test to first shell fitting will result in identical
fits for all iorder values. Single scattering paths are computed exactly
in Feff. It is only multiple scattering paths that are subject to the
IORDER approximation.

The executive summary of this test is that the original assessment of
6x6 (IORDER=2) is the correct choice.

** Future tests

Here are some ideas for new things to try

-  SCF test on a temperature sequence (NiO, Copper, FeS2,
   bromoadamantane can all be done easily)
-  Multi-pole self-energy, full calculation or John's idea for a
   MPSE-lite (basically a broadened single pole)
-  Calculation R-grid (RGRID=0.05 is the default, could try 0.03, 0.01,
   and 0.07)
-  Output k grid (this would require editing code)

* Workflow

** Interactive testing

The testing is implemented as a larch plugin. Once larch has been
started, load the =fefftest= plugin:

#+BEGIN_EXAMPLE
    larch> add_plugin('fefftest')
#+END_EXAMPLE

Note that these instructions presume that your working directory is the
main directory of the repository. This is not a Larch plugin in the
sense that it is designed and written to be used anywhere and in any
way. The workflow of the Feff testing expects to find certain files in
certain locations. The easiest way to ensure this is to do you testing
in the repository directory.

Once the plugin is loaded, create a FeffTestGroup object, set some of
its attributes, and prepare the Feff calculations:

#+BEGIN_EXAMPLE
    larch> a = ft()
    larch> a.test = 'scf'
    larch> a.material = 'Copper'
    larch> a.prep()
#+END_EXAMPLE

The =a.prep()= step may be quite time consuming, depending on the SCF
radii used in the testing steps.

If the Feff calculations have already be run, this will be noticed when
setting the =material= attribute. In that case, the =prep()= step can be
skipped, and you can proceed directly to fitting.

Once the Feff calculations have run to completion, you can run the
canned fitting model using each of the Feff models:

#+BEGIN_EXAMPLE
    larch> a.fits()
    >>>>>>>>> fitting with model: feff6
    wrote to file 'Copper/scf/fit_feff6.k'
    wrote to file 'Copper/scf/fit_feff6.r'
    >>>>>>>>> fitting with model: noSCF
    wrote to file 'Copper/scf/fit_noSCF.k'
    wrote to file 'Copper/scf/fit_noSCF.r'
    >>>>>>>>> fitting with model: withSCF_3
    wrote to file 'Copper/scf/fit_withSCF_3.k'
    wrote to file 'Copper/scf/fit_withSCF_3.r'
      (and so on)
#+END_EXAMPLE

There is no persistence of the fitting results (yet).

*** Make a plot of any fit:

#+BEGIN_EXAMPLE
    larch> a.plot('feff6')
#+END_EXAMPLE

As a shortcut, you can use integer arguments where the integers refer to
the (1-based) position of the model in the =models= attribute. For
example,

#+BEGIN_EXAMPLE
    larch> show a.models
    ['feff6', 'noSCF', withSCF_3', withSCF_4', withSCF_5', withSCF_5.5', withSCF_6']
    larch> a.plot(1)
#+END_EXAMPLE

=a.plot(1)= and =a.plot('feff6')= make the same plot.

