use.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Using the Feff testing framework</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bruce Ravel" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Using the Feff testing framework</h1>
<div id="table-of-contents">
<h1>Feff testing framework</h1>
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Prerequisites</a></li>
<li><a href="#orgheadline2">2. Curated set of standard data</a></li>
<li><a href="#orgheadline6">3. Established tests</a>
<ul>
<li><a href="#orgheadline3">3.1. SCF</a></li>
<li><a href="#orgheadline4">3.2. iorder</a></li>
<li><a href="#orgheadline5">3.3. Future tests</a></li>
</ul>
</li>
<li><a href="#orgheadline14">4. Workflow</a>
<ul>
<li><a href="#orgheadline12">4.1. Interactive testing</a>
<ul>
<li><a href="#orgheadline7">4.1.1. Make a plot of any fit:</a></li>
<li><a href="#orgheadline8">4.1.2. Make a nice PNG image of any fit:</a></li>
<li><a href="#orgheadline9">4.1.3. Examine an individual parameter</a></li>
<li><a href="#orgheadline10">4.1.4. Tables of fit results</a></li>
<li><a href="#orgheadline11">4.1.5. Examine the full fit report</a></li>
</ul>
</li>
<li><a href="#orgheadline13">4.2. A larch script for testing all standards</a></li>
</ul>
</li>
<li><a href="#orgheadline15">5. Adding new materials</a></li>
<li><a href="#orgheadline16">6. Adding new tests</a></li>
<li><a href="#orgheadline17">7. Making the web pages</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Prerequisites</h2>
<div class="outline-text-2" id="text-1">
<p>
You <b>must</b> have these tools on your computer, properly built, installed,
and functioning:
</p>

<ol class="org-ol">
<li><a href="https://github.com/xraypy/xraylarch">Larch</a></li>
<li><a href="https://github.com/xraypy/feff85exafs">feff85exafs</a></li>
</ol>

<p>
The following python modules are used (<code>sudo pip install &lt;module&gt;</code>):
</p>

<ol class="org-ol">
<li><a href="https://github.com/defunkt/pystache">pystache</a></li>
<li><a href="https://pypi.python.org/pypi/tabulate">tabulate</a></li>
</ol>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Curated set of standard data</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Copper</li>
<li>NiO</li>
<li>FeS2</li>
<li>UO2</li>
<li>BaZrO3</li>
<li>Uranyl ion in solution</li>
<li>bromoadamantane</li>
</ol>

<p>
Each of these folders has much of the same stuff as the data-bearing
tests for <a href="https://github.com/xraypy/feff85exafs">feff85exafs</a>, including a mustache template for <code>feff.inp</code>, a
json file controlling how the template is filled in, χ(k) data, a
python script defining a fitting model using Larch, and a Feff6 input
file.
</p>

<p>
Future materials:
</p>

<ul class="org-ul">
<li>methyltin, multiple data set, simple molecule</li>
<li>???</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">3</span> Established tests</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> SCF</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This is a test that runs any of the curated standards against a sequence
of different Feff models related to probing the effect of
self-consistency. Feff will be run in each of the following ways:
</p>

<ol class="org-ol">
<li>Feff6</li>
<li>Feff8 without self-consistency</li>
<li>Feff8 with one or more radii for the self-consistency computation</li>
</ol>

<p>
The point of this test is to evaluate the effect of the Feff model on
EXAFS fitting. This tests Feff6 against Feff8 and self-consistency
against the absence of self-consistency.
</p>

<p>
As discussed elsewhere, self-consistency provides scant impact on the
quality of the EXAFS analysis or on the measured results.
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">3.2</span> iorder</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In the paper that introduced Feff6 (<a href="http://dx.doi.org/10.1103/PhysRevB.52.2995">DOI: 10.1103/PhysRevB.52.2995</a>),
the authors discuss an approximation made in the computation of the
Rehr-Albers separable propagators. The scaling of the spherical harmonic
scattering factors used to compute the photoelectron free propagator is
such that the corresponding matrix can be limited in dimension to 6x6.
There is some discussion about the accuracy of this approximation at
high energy, but the authors assert the numerical accuracy of this
approximation is within 1% of the full calculation at photoelectron
wavenumbers below 20.
</p>

<p>
The size of this matrix is controlled in the Feff input file by the
IORDER keyword. The default value of 2 corresponds to the 6x6 matrix.
The assertion that the 6x6 matrix is adequate is easily tested using
this testing framework.
</p>

<p>
The iorder test runs Feff8 with a short self-consistency radius and with
a range of iorder values, including 1, 2, 3, 4, and 10 (10 being
something the source code refers to as the &ldquo;cute&rdquo; algorithm).
</p>

<p>
Limiting the iorder test to first shell fitting will result in identical
fits for all iorder values. Single scattering paths are computed exactly
in Feff. It is only multiple scattering paths that are subject to the
IORDER approximation.
</p>

<p>
The executive summary of this test is that the original assessment of
6x6 (IORDER=2) is the correct choice.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">3.3</span> Future tests</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Here are some ideas for new things to try
</p>

<ul class="org-ul">
<li>SCF test on a temperature sequence (NiO, Copper, FeS2,
bromoadamantane can all be done easily)</li>
<li>Multi-pole self-energy, full calculation or John&rsquo;s idea for a
MPSE-lite (basically a broadened single pole)
<ul class="org-ul">
<li><a href="http://dx.doi.org/10.1103/PhysRevB.76.195116">Original paper by Kas et al</a></li>
<li><a href="http://dx.doi.org/10.1088/1742-6596/190/1/012023">XAFS 14 paper, Newville, Kas, Rehr</a></li>
</ul></li>
<li>Calculation R-grid (RGRID=0.05 is the default, could try 0.03, 0.01,
and 0.07)</li>
<li>Output k grid (this would require editing code)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">4</span> Workflow</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">4.1</span> Interactive testing</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The testing is implemented as a larch plugin. Once larch has been
started, load the <code>fefftest</code> plugin:
</p>

<pre class="example">
larch&gt; add_plugin('fefftest')
</pre>

<p>
Note that these instructions presume that your working directory is the
main directory of the repository. This is not a Larch plugin in the
sense that it is designed and written to be used anywhere and in any
way. The workflow of the Feff testing expects to find certain files in
certain locations. The easiest way to ensure this is to do you testing
in the repository directory.
</p>

<p>
Once the plugin is loaded, create a FeffTestGroup object, set some of
its attributes, and prepare the Feff calculations:
</p>

<pre class="example">
larch&gt; a = ft()
larch&gt; a.test = 'scf'
larch&gt; a.material = 'Copper'
larch&gt; a.prep()
</pre>

<p>
The <code>a.prep()</code> step may be quite time consuming, depending on the SCF
radii used in the testing steps.
</p>

<p>
If the Feff calculations have already be run, this will be noticed when
setting the <code>material</code> attribute. In that case, the <code>prep()</code> step can be
skipped, and you can proceed directly to fitting.
</p>

<p>
Once the Feff calculations have run to completion, you can run the
canned fitting model using each of the Feff models:
</p>

<pre class="example">
larch&gt; a.fits()
&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; fitting with model: feff6
wrote to file 'Copper/scf/fit_feff6.k'
wrote to file 'Copper/scf/fit_feff6.r'
&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; fitting with model: noSCF
wrote to file 'Copper/scf/fit_noSCF.k'
wrote to file 'Copper/scf/fit_noSCF.r'
&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; fitting with model: withSCF_3
wrote to file 'Copper/scf/fit_withSCF_3.k'
wrote to file 'Copper/scf/fit_withSCF_3.r'
  (and so on)
</pre>

<p>
There is no persistence of the fitting results (yet).
</p>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">4.1.1</span> Make a plot of any fit:</h4>
<div class="outline-text-4" id="text-4-1-1">
<pre class="example">
larch&gt; a.plot('feff6')
</pre>

<p>
As a shortcut, you can use integer arguments where the integers refer to
the (1-based) position of the model in the <code>models</code> attribute. For
example,
</p>

<pre class="example">
larch&gt; show a.models
['feff6', 'noSCF', withSCF_3', withSCF_4', withSCF_5', withSCF_5.5', withSCF_6']
larch&gt; a.plot(1)
</pre>

<p>
<code>a.plot(1)</code> and <code>a.plot('feff6')</code> make the same plot.
</p>
</div>
</div>
