use.org
*** Make a nice PNG image of any fit:

#+BEGIN_EXAMPLE
    larch> a.png('feff6')
#+END_EXAMPLE

In the case of the Copper SCF test, this writes a file to
=Copper/scf/fit_feff6.png=.

The integer shortcut from the =plot()= method can be used here.

*** Examine an individual parameter

To examine the evolution of an individual fitting parameter over the
sequence of Feff calculations:

#+BEGIN_EXAMPLE
    larch> a.compare('enot')
           feff6: 4.96784 +/- 0.49360
           noSCF: 5.70543 +/- 0.48196
       withSCF_3: 3.44875 +/- 0.56411
       withSCF_4: 3.54301 +/- 0.56281
       withSCF_5: 3.39539 +/- 0.56334
     withSCF_5.5: 3.40748 +/- 0.56450
       withSCF_6: 3.46357 +/- 0.56386
#+END_EXAMPLE

*** Tables of fit results

To generate a table of results for variables and statistical parameters
from the fit sequence:

#+BEGIN_EXAMPLE
    larch> print a.table()

    Best fit values

    | model        | alpha         | amp     | enot     | ss1         | thetad   |
    |:-------------|:--------------|:--------|:---------|:------------|:---------|
    | feff6        | -0.00074(92)  | 0.96(4) | 4.97(49) | 0.00382(33) | 253(22)  |
    | noSCF        | -0.00046(90)  | 0.95(4) | 5.71(48) | 0.00400(33) | 239(19)  |
    | withSCF(3)   | -0.00077(104) | 0.94(5) | 3.45(56) | 0.00402(38) | 241(22)  |
    | withSCF(4)   | -0.00076(104) | 0.94(5) | 3.54(56) | 0.00402(38) | 242(22)  |
    | withSCF(5)   | -0.00077(104) | 0.94(5) | 3.40(56) | 0.00402(38) | 241(22)  |
    | withSCF(5.5) | -0.00077(105) | 0.94(5) | 3.41(56) | 0.00402(38) | 241(22)  |
    | withSCF(6)   | -0.00076(104) | 0.94(5) | 3.46(56) | 0.00402(38) | 241(22)  |

    Statistics

    | model        |   chi-square |   chi-reduced |   R-factor |
    |:-------------|-------------:|--------------:|-----------:|
    | feff6        |    1444.2957 |       54.3832 |     0.0145 |
    | noSCF        |    1412.8206 |       53.1981 |     0.0142 |
    | withSCF(3)   |    1820.8201 |       68.5608 |     0.0182 |
    | withSCF(4)   |    1814.2834 |       68.3147 |     0.0182 |
    | withSCF(5)   |    1816.9001 |       68.4132 |     0.0182 |
    | withSCF(5.5) |    1823.0856 |       68.6461 |     0.0183 |
    | withSCF(6)   |    1819.9264 |       68.5271 |     0.0182 |
#+END_EXAMPLE

The formatting of the table is controlled by the =tableformat=
attribute and can be any of the [[https://pypi.python.org/pypi/tabulate#table-format][strings specified here]]. By default,
the =pipe= format is used. =latex= is handled specially by the
=table()= method.

*** Examine the full fit report

#+BEGIN_EXAMPLE
    larch> a.report('feff6')
#+END_EXAMPLE

This writes larch's fit report to the screen for the fit using the
specified Feff model.

The integer shortcut from the =plot()= method can be used here.

** A larch script for testing all standards

Here is a very simple script. It will be quite time consuming as Feff
must be run in the =prep()= step for each material.

#+BEGIN_SRC python
    add_plugin('fefftest')
    a = ft()
    a.test = 'scf'
    for m in ("Copper", "NiO", "FeS2", "UO2", "BaZrO3", "bromoadamantane", "uranyl"):
        a.material = m
        a.prep()
        a.fits()
        print a.table()
    #endfor
#+END_SRC

It would be wise to capture the output of the =table()= method in some
way. As this example is written, the table containing the fitting
results will be lost among the voluminous screen output of the many Feff
runs.

* Adding new materials

Each material must have a set of files with specific names. Using Copper
as the example, there must be a subdirectory of the repository called
=Copper=. In that subdirectory, there must be the following files:

1. =Copper.json=: a JSON file containing values used in the mustache
   file
2. =Copper.mustache=: a feff.inp for running Feff8 with certain values
   replaced by [[https://github.com/mustache/mustache][mustache]] tokens corresponding to the scalar entries in
   =Copper.json=
3. =Copper.feff6=: the same feff.inp data, but structured for use with
   Feff6
4. =Copper.py=: the fitting model, using larch syntax for setting up and
   running the fit
5. =Copper.chik=: the χ(k) as a column ASCII file with wavenumber in the
   first column and un-k-weighted χ(k) in the second column

So, if you introduce a new material, you *must* provide each of these
files, replacing =Copper= with the name of the new material.

A few notes:

- In the JSON file, the =radii= item is a list of radii over which to
  compute the self-consistency. Unless the material is a small
  molecule, you should select 5 or so values. The first should include
  only the first coordination shell. The largest radii should not be so
  large that the Feff calculation takes inordinately long.
- For the mustache template of the feff.inp file, follow the example of
  the ones already in the repository. You will likely want to generate
  a Feff8 input file using whatever tool you normally use (Atoms, for
  example), then edit it by hand to insert the mustache tokens in the
  same places as in the examples.
- For the Feff6 input file, just use Atoms (or whatever) to make a
  Feff6 input, then rename it.
- For the fitting model in the =.py= file, again follow the examples
  given. How you set up the parameters and paths is entirely up to, but
  be sure to include all of the logic towards the end of the file,
  including:
  + The setting of =rx=, the upper bound of the fit in R
  + The bits controlled with the =doplot= and =verbose= flags
  + The writing of the output ASCII column files
  + The writing of the gnuplot script, making sure to set all of its
    mustache substitutions correctly for your fitting model
- My typical pattern was to play with the fitting model in Artemis, the
  reproduce my final model in the =.py= file. I then used Artemis to
  generate the =.chik= file.

