use.html

<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">4.1.2</span> Make a nice PNG image of any fit:</h4>
<div class="outline-text-4" id="text-4-1-2">
<pre class="example">
larch&gt; a.png('feff6')
</pre>

<p>
In the case of the Copper SCF test, this writes a file to
<code>Copper/scf/fit_feff6.png</code>.
</p>

<p>
The integer shortcut from the <code>plot()</code> method can be used here.
</p>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">4.1.3</span> Examine an individual parameter</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
To examine the evolution of an individual fitting parameter over the
sequence of Feff calculations:
</p>

<pre class="example">
larch&gt; a.compare('enot')
       feff6: 4.96784 +/- 0.49360
       noSCF: 5.70543 +/- 0.48196
   withSCF_3: 3.44875 +/- 0.56411
   withSCF_4: 3.54301 +/- 0.56281
   withSCF_5: 3.39539 +/- 0.56334
 withSCF_5.5: 3.40748 +/- 0.56450
   withSCF_6: 3.46357 +/- 0.56386
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">4.1.4</span> Tables of fit results</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
To generate a table of results for variables and statistical parameters
from the fit sequence:
</p>

<pre class="example">
larch&gt; print a.table()

Best fit values

| model        | alpha         | amp     | enot     | ss1         | thetad   |
|:-------------|:--------------|:--------|:---------|:------------|:---------|
| feff6        | -0.00074(92)  | 0.96(4) | 4.97(49) | 0.00382(33) | 253(22)  |
| noSCF        | -0.00046(90)  | 0.95(4) | 5.71(48) | 0.00400(33) | 239(19)  |
| withSCF(3)   | -0.00077(104) | 0.94(5) | 3.45(56) | 0.00402(38) | 241(22)  |
| withSCF(4)   | -0.00076(104) | 0.94(5) | 3.54(56) | 0.00402(38) | 242(22)  |
| withSCF(5)   | -0.00077(104) | 0.94(5) | 3.40(56) | 0.00402(38) | 241(22)  |
| withSCF(5.5) | -0.00077(105) | 0.94(5) | 3.41(56) | 0.00402(38) | 241(22)  |
| withSCF(6)   | -0.00076(104) | 0.94(5) | 3.46(56) | 0.00402(38) | 241(22)  |

Statistics

| model        |   chi-square |   chi-reduced |   R-factor |
|:-------------|-------------:|--------------:|-----------:|
| feff6        |    1444.2957 |       54.3832 |     0.0145 |
| noSCF        |    1412.8206 |       53.1981 |     0.0142 |
| withSCF(3)   |    1820.8201 |       68.5608 |     0.0182 |
| withSCF(4)   |    1814.2834 |       68.3147 |     0.0182 |
| withSCF(5)   |    1816.9001 |       68.4132 |     0.0182 |
| withSCF(5.5) |    1823.0856 |       68.6461 |     0.0183 |
| withSCF(6)   |    1819.9264 |       68.5271 |     0.0182 |
</pre>

<p>
The formatting of the table is controlled by the <code>tableformat</code>
attribute and can be any of the <a href="https://pypi.python.org/pypi/tabulate#table-format">strings specified here</a>. By default,
the <code>pipe</code> format is used. <code>latex</code> is handled specially by the
<code>table()</code> method.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">4.1.5</span> Examine the full fit report</h4>
<div class="outline-text-4" id="text-4-1-5">
<pre class="example">
larch&gt; a.report('feff6')
</pre>

<p>
This writes larch&rsquo;s fit report to the screen for the fit using the
specified Feff model.
</p>

<p>
The integer shortcut from the <code>plot()</code> method can be used here.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">4.2</span> A larch script for testing all standards</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Here is a very simple script. It will be quite time consuming as Feff
must be run in the <code>prep()</code> step for each material.
</p>

<div class="org-src-container">

<pre class="src src-python">add_plugin(<span class="org-string">'fefftest'</span>)
<span class="org-variable-name">a</span> = ft()
<span class="org-variable-name">a.test</span> = <span class="org-string">'scf'</span>
<span class="org-keyword">for</span> m <span class="org-keyword">in</span> (<span class="org-string">"Copper"</span>, <span class="org-string">"NiO"</span>, <span class="org-string">"FeS2"</span>, <span class="org-string">"UO2"</span>, <span class="org-string">"BaZrO3"</span>, <span class="org-string">"bromoadamantane"</span>, <span class="org-string">"uranyl"</span>):
    <span class="org-variable-name">a.material</span> = m
    a.prep()
    a.fits()
    <span class="org-keyword">print</span> a.table()
<span class="org-comment-delimiter">#</span><span class="org-comment">endfor</span>
</pre>
</div>

<p>
It would be wise to capture the output of the <code>table()</code> method in some
way. As this example is written, the table containing the fitting
results will be lost among the voluminous screen output of the many Feff
runs.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-2">
<h2 id="orgheadline15"><span class="section-number-2">5</span> Adding new materials</h2>
<div class="outline-text-2" id="text-5">
<p>
Each material must have a set of files with specific names. Using Copper
as the example, there must be a subdirectory of the repository called
<code>Copper</code>. In that subdirectory, there must be the following files:
</p>

<ol class="org-ol">
<li><code>Copper.json</code>: a JSON file containing values used in the mustache
file</li>
<li><code>Copper.mustache</code>: a feff.inp for running Feff8 with certain values
replaced by <a href="https://github.com/mustache/mustache">mustache</a> tokens corresponding to the scalar entries in
<code>Copper.json</code></li>
<li><code>Copper.feff6</code>: the same feff.inp data, but structured for use with
Feff6</li>
<li><code>Copper.py</code>: the fitting model, using larch syntax for setting up and
running the fit</li>
<li><code>Copper.chik</code>: the χ(k) as a column ASCII file with wavenumber in the
first column and un-k-weighted χ(k) in the second column</li>
</ol>

<p>
So, if you introduce a new material, you <b>must</b> provide each of these
files, replacing <code>Copper</code> with the name of the new material.
</p>

<p>
A few notes:
</p>

<ul class="org-ul">
<li>In the JSON file, the <code>radii</code> item is a list of radii over which to
compute the self-consistency. Unless the material is a small
molecule, you should select 5 or so values. The first should include
only the first coordination shell. The largest radii should not be so
large that the Feff calculation takes inordinately long.</li>
<li>For the mustache template of the feff.inp file, follow the example of
the ones already in the repository. You will likely want to generate
a Feff8 input file using whatever tool you normally use (Atoms, for
example), then edit it by hand to insert the mustache tokens in the
same places as in the examples.</li>
<li>For the Feff6 input file, just use Atoms (or whatever) to make a
Feff6 input, then rename it.</li>
<li>For the fitting model in the <code>.py</code> file, again follow the examples
given. How you set up the parameters and paths is entirely up to, but
be sure to include all of the logic towards the end of the file,
including:
<ul class="org-ul">
<li>The setting of <code>rx</code>, the upper bound of the fit in R</li>
<li>The bits controlled with the <code>doplot</code> and <code>verbose</code> flags</li>
<li>The writing of the output ASCII column files</li>
<li>The writing of the gnuplot script, making sure to set all of its
mustache substitutions correctly for your fitting model</li>
</ul></li>
<li>My typical pattern was to play with the fitting model in Artemis, the
reproduce my final model in the <code>.py</code> file. I then used Artemis to
generate the <code>.chik</code> file.</li>
</ul>
</div>
</div>
