use.org
* Adding new tests

A new test is added by making a new python script in the =fefftests=
folder. This python file defines the =prep()= method. That is, it
defines the conditions under which Feff is run, then makes each Feff
calculation.

The scf and iorder tests are pretty well commented. Follow those
examples. The bottom line is that they loop through the list of testing
conditions. For each condition, a subdirectory called
=<testname>/<condition>= is created. The mustache template is filled in
and written to =<testname>/<condition>/feff.inp=. Finally, Feff is run.

Note that, to verify that the /exact/ same set of scattering paths are
used for every test, the =paths.dat= file from the =scf/feff6= test
should be copied into each new testing subdirectory. The reason for this
is to be sure that path indexing is consistent between models. Which a
small change to the Feff model, the amplitude of a small path might
cause it to fall below one of Feff's filtering criteria. This would
change the indexing of subsequent paths. The fitting models in the =.py=
files expect consistent path indexing.

If you add a new material, you should edit the =fefftest.py= plugin file
to add the name of your new material to the list at line 42.

If your test requires modification of the =feff.inp= file, then you
should edit the =<material>.mustache= file for each material accordingly
and add the necessary parameters to the =<material>.json= files. Be sure
to provide a sensible default for your new parameters so that other
tests will still run correctly.

* Making the web pages

I use emacs, git, and GitHub to manage the web pages.

Generating html pages for the GitHub Pages site uses several
emacs-related features, including:

1. [[org-mode][http://orgmode.org/]]
2. The [[https://github.com/fniessen/org-html-themes][ReadTheOrg]] export theme (slightly modified by me, with my
   modifications pushed to the =gh-pages= branch)
3. The [[https://github.com/fniessen/orgmk][orgmk]] batch processer
4. The [[https://melpa.org/#/htmlize][htmlize package]]

My workflow is that I edit the =.org= files in Emacs.  I then use the
simple =o2h.sh= command line script to process each of the org files
into html files.  The html files, along with style and image files,
are pushed to the =gh-pages= branch of the repository.
