use.html

<div id="outline-container-orgheadline16" class="outline-2">
<h2 id="orgheadline16"><span class="section-number-2">6</span> Adding new tests</h2>
<div class="outline-text-2" id="text-6">
<p>
A new test is added by making a new python script in the <code>fefftests</code>
folder. This python file defines the <code>prep()</code> method. That is, it
defines the conditions under which Feff is run, then makes each Feff
calculation.
</p>

<p>
The scf and iorder tests are pretty well commented. Follow those
examples. The bottom line is that they loop through the list of testing
conditions. For each condition, a subdirectory called
<code>&lt;testname&gt;/&lt;condition&gt;</code> is created. The mustache template is filled in
and written to <code>&lt;testname&gt;/&lt;condition&gt;/feff.inp</code>. Finally, Feff is run.
</p>

<p>
Note that, to verify that the <i>exact</i> same set of scattering paths are
used for every test, the <code>paths.dat</code> file from the <code>scf/feff6</code> test
should be copied into each new testing subdirectory. The reason for this
is to be sure that path indexing is consistent between models. With a
small change to the Feff model, the amplitude of a small path might
cause it to fall below one of Feff&rsquo;s filtering criteria. This would
change the indexing of subsequent paths. The fitting models in the <code>.py</code>
files expect consistent path indexing.
</p>

<p>
If you add a new material, you should edit the <code>fefftest.py</code> plugin file
to add the name of your new material to the list at line 42.
</p>

<p>
If your test requires modification of the <code>feff.inp</code> file, then you
should edit the <code>&lt;material&gt;.mustache</code> file for each material accordingly
and add the necessary parameters to the <code>&lt;material&gt;.json</code> files. Be sure
to provide a sensible default for your new parameters so that other
tests will still run correctly.
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">7</span> Making the web pages</h2>
<div class="outline-text-2" id="text-7">
<p>
I use emacs, git, and GitHub to manage the web pages.
</p>

<p>
Generating html pages for the GitHub Pages site uses several
emacs-related features, including:
</p>

<ol class="org-ol">
<li>Emacs&rsquo; <a href="http://orgmode.org/">org-mode</a></li>
<li>The <a href="https://github.com/fniessen/org-html-themes">ReadTheOrg</a> export theme (slightly modified by me, with my
modifications pushed to the <code>gh-pages</code> branch)</li>
<li>The <a href="https://github.com/fniessen/orgmk">orgmk</a> batch processer</li>
<li>The <a href="https://melpa.org/#/htmlize">htmlize package</a></li>
</ol>

<p>
My workflow is that I edit the <code>.org</code> files in Emacs.  I then use the
simple <code>o2h.sh</code> command line script to process each of the org files
into html files.  The html files, along with style and image files,
are pushed to the <code>gh-pages</code> branch of the repository.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-02-18</p>
<p class="author">Author: Bruce Ravel</p>
<p>
  <a href="https://github.com/bruceravel/SCFtests">View on GutHub</a>
  &nbsp;&nbsp;|&nbsp;&nbsp;
  <a href="index.html">Home</a>
</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
